In [1]:
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd
import seaborn as sns
import sklearn

In [2]:
url = "https://raw.githubusercontent.com/mTochilashvili/MachineLearning/main/BD/USA_cars_datasets.csv"
data_raw = pd.read_csv(url)
data = pd.read_csv(url)
data_raw.shape

(2499, 13)

In [3]:
data_raw.head()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [4]:
data_raw.columns

Index(['Unnamed: 0', 'price', 'brand', 'model', 'year', 'title_status',
       'mileage', 'color', 'vin', 'lot', 'state', 'country', 'condition'],
      dtype='object')

In [5]:
data_raw.drop(['Unnamed: 0', 'vin', 'lot', 'condition'], axis=1, inplace = True)

In [6]:
data_raw['price']

0        6300
1        2899
2        5350
3       25000
4       27700
        ...
2494     7800
2495     9200
2496     9200
2497     9200
2498     9200
Name: price, Length: 2499, dtype: int64

In [7]:
data_raw['binary_price'] = np.where(data_raw['price'] >= 42450, 1, 0)
data_raw[['price', 'binary_price']]

      price  binary_price
0      6300             0
1      2899             0
2      5350             0
3     25000             0
4     27700             0
...     ...           ...
2494   7800             0
2495   9200             0
2496   9200             0
2497   9200             0
2498   9200             0

[2499 rows x 2 columns]

In [8]:
data_raw['brand'] = data_raw['brand'].astype('category')
data_raw['brand'].dtype

CategoricalDtype(categories=['acura', 'audi', 'bmw', 'buick', 'cadillac', 'chevrolet',
                  'chrysler', 'dodge', 'ford', 'gmc', 'harley-davidson',
                  'heartland', 'honda', 'hyundai', 'infiniti', 'jaguar',
                  'jeep', 'kia', 'land', 'lexus', 'lincoln', 'maserati',
                  'mazda', 'mercedes-benz', 'nissan', 'peterbilt', 'ram',
                  'toyota'],
, ordered=False, categories_dtype=object)

In [9]:
data_raw['title_status'] = data_raw['title_status'].astype('category')
data_raw['title_status'].dtype

CategoricalDtype(categories=['clean vehicle', 'salvage insurance'], ordered=False, categories_dtype=object)

In [10]:
data_raw['country'] = data_raw['country'].astype('category')
data_raw['country'].dtype

CategoricalDtype(categories=[' canada', ' usa'], ordered=False, categories_dtype=object)

In [11]:
data_raw.describe()

              price         year       mileage  binary_price
count   2499.000000  2499.000000  2.499000e+03   2499.000000
mean   18767.671469  2016.714286  5.229869e+04      0.049620
std    12116.094936     3.442656  5.970552e+04      0.217202
min        0.000000  1973.000000  0.000000e+00      0.000000
25%    10200.000000  2016.000000  2.146650e+04      0.000000
50%    16900.000000  2018.000000  3.536500e+04      0.000000
75%    25555.500000  2019.000000  6.347250e+04      0.000000
max    84900.000000  2020.000000  1.017936e+06      1.000000

In [12]:
data_raw.describe(include=['category'])

       brand   title_status country
count   2499           2499    2499
unique    28              2       2
top     ford  clean vehicle     usa
freq    1235           2336    2492

In [15]:
corr_mat = data_raw.corr()
corr_mat

ValueError: could not convert string to float: 'cruiser'